package javaCore.src.lesson1_3.levelA.a3;
/*
Создать две переменные типа int и проинициализировать их значениями 7 и 5.
 Выведите в консоль остаток от деления первого числа на второе.
 */
public class Run {
    public static void main(String[] args) {
        int var1=7;
        int var2=5;
        System.out.println("Остаток от деления: "+(var1%var2));
    }
}
